yoga_api/app/controllers/poses_controller.rb

SELECT "poses".* FROM "poses"
---
  def index
    @poses = Pose.all